{"pages":[],"posts":[{"title":"Welcome to my blog","text":"","link":"/2022/05/02/welcome/"},{"title":"Flying UAV around hometown condo","text":"Last year when my younger brother got married, my sister and I bought a DJI air 3 to capture the wonderful memories. Since then I start to imagine having our own UVAs, to record the current lifes and when we are old, it could be a good fortune for us. Besides, I can make videos as a promotion for my hometown, the old city with traditional cultures. This summer, my sister and I finally decide to buy a DJI mini 3 to train ourselves to be pilots of UVA. Though being confronted with some obstacles, we make our first satisfied flying trip on 14th June. The edited video is posted on Bilibili.济宁北湖区夜景航拍～2022年6月","link":"/2022/07/05/remakes/"},{"title":"Save earth as a geophysist","text":"This is a motivation letter I wrote in September 2021, when I was going to attend a CO2 challenge. However, the last minute I found there has to be more than half undergraduate students among group members. So I leave it here. In recent years, rare and even unprecedented extreme weather has arisen more frequently and wildly over the whole world. Summer gets hotter. This July, extreme heat reaches an unprecedented high temperature up to 54.4 Celsius, scorching western Canada and the USA. The storm gathers unexpectedly. On the land of Eurasia, a rainstorm hits India and takes away 135 people pitilessly. More severe floods happen in Henan, China, and North Rhine-Westphalia, Germany. Even winter becomes abnormal where winter storm causes power crisis in Texas, challenging centuries of the human industrial civilizations. These oncoming events reveal that it is more than just global warming. It is about the change of the balanced climate of the Earth from poles to the equator, from the summer to the winter. As described in the movie the day after tomorrow, the melting ice sheet weakens the formation of deep water in the northern North Atlantic, reducing the transport of warm water from south to north. The effect of heat salt circulation slows, breaking the global heat balance, cooling the climate in Europe and eastern North America, and ultimately accelerating the Earth into the next ice age. Scientists have studied for years how climate change is formed. The Intergovernmental Panel on Climate Change (IPCC) warns that human activities produce overwhelming greenhouse gas, resulting in the rise of the temperature, the rise of the sea level, and now the catastrophic impact of global climate. Among all the greenhouse gases, the emission of CO2 takes the most significant proportion and is the culprit of climate change. When tracing back to the sources of the CO2 emission, it is not hard to spot the burning of fossil fuels. Unfortunately, the fifth assessment report in 2014 did not evoke enough attention. Compared to the so-called climate change, which most people unknown and unconvinced, people intended to maintain the progressive production, especially in the less developed countries and regions, because the restriction on fossil fuel energy means to deprive their subsistence and the hope for prosperity right the moment. Besides, the new clean energies were just emerging to very limited industrial applications. In recent years, we have gradually seen the development of electric cars as a powerful replacement for petrol vehicles. “If it’s not renewable, it’s going to run out at some point,” Elon Musk says. Though only reducing the usage of fossil fuels becomes far not enough to protect our Earth anymore. The sixth assessment report from IPCC emphasizes that only reaching the net-zero goal by 2050 could maintain the rise of global temperature in a relatively safe range of 2 Celsius in 2100. The net-zero requires CO2 to be captured, sequestrated, and, more economically, utilized by the industries. When it comes to Carbon Capture, Utilization, and Storage (CCUS), plenty of efforts can be contributed by the society of geoscientists and engineers. Injection of CO2 to the deep saline aquifer is the safest approach to storage CO2 permanently. Several decades of oil exploration practice solidly on injecting CO2 deep inside the Earth, accumulating the knowledge and experience on the examination of the subsurface medium. These include but are not limited to finding the saline aquifer and the caprock, modeling the reservoir, monitoring the injection, monitoring and detecting the migration or leakage of the CO2. Specific to our team, we are an integrated multidisciplinary group with geophysicists, experts of high-performance computing (HPC), experts of artificial intelligence (AI), and amateur of meteorology. We have passion and would like to contribute our efforts to the health of our planet as much as possible. Members in geophysical background learn better about the subsurface condition, HPC and AI help to accelerate the conventional method to reduce the cost of CCUS, and a wider knowledge of earth system science provide us a more comprehensive understanding of the issues. We are ready and looking forward to exploring the bright possibilities our young people could make.","link":"/2021/09/30/CO2/"},{"title":"Learn to write from an admirable book","text":"A writing practice during the class of Prof. Fu Learn to write from an admirable book –The Looming Tower: Al-Qaeda and the Road to 9/11 The Looming Tower is a nonfiction work depicting the rise of Al-Qaeda and its road to 9/11. Published in 2006, with a total of 13 years’ investigation, the book swept a series of awards and won Pulitzer Prize the same year, yet still quite little-known for people who show no interest in Geopolitics or the Middle East. Whereas it is an addictive poison for someone outside the Islamic world who grabs the huge curiosity and finds the book revealing the mystery of Osama Bin Laden, together with the squad of the Jihadism, looming from the other side of the planet. One may be amazed, bewildered, sympathetic, or resentful towards a similar but distinct human being. No matter how esoteric the content would be, literature that began with a well-known element would always be a good way to attract attention and evoke curiosities. Unsealing the book, a scene leaps to the eyes where an FBI agent drives ahead an intelligence station. Even if the audience knows nothing about Islam, he or she would largely hear of the FBI and wonder what to do with this grave organization, till the brisk emergence of the notorious name Bin Laden, evoking another point of interest. As nonfiction, its words are plain, ungarnished, but very informative. Every sentence is fresh. Linked by the book, you could have magically gone through the whole life of Sayyid Qutb, conjecturing his stubborn conservation may be from his miserable childhood or somehow just the disabled of DNAs, and worried why he could not think like yourself. They like to make a long name after as many generations as they can, then you could delineate the coincidence of three al-Zawahiri, four Mohammed, and five Abu. You could also learn how arrogant the FBI could be, and the infighting between the FBI and CIA would blow the minds of the heroical figure in the popular movies. Besides, it was not until 2014 that the Chinese version of the book came off the press. Half of its success spread in Chinese-spoken countries should be attributed to the vivid translation. The pitch of reading in Chinese is fluent, and the most important is that the reading would not remind one of any hint of its translation. Finally, to conclude the success of the writing of this book, we would say it is the attractive beginning, the real informative stories and the depth into religion and ideology.","link":"/2021/10/08/looming/"}],"tags":[{"name":"info","slug":"info","link":"/tags/info/"},{"name":"life","slug":"life","link":"/tags/life/"},{"name":"thoughts","slug":"thoughts","link":"/tags/thoughts/"},{"name":"literature","slug":"literature","link":"/tags/literature/"}],"categories":[{"name":"info","slug":"info","link":"/categories/info/"},{"name":"The interest of life","slug":"The-interest-of-life","link":"/categories/The-interest-of-life/"},{"name":"environment","slug":"environment","link":"/categories/environment/"},{"name":"earth","slug":"environment/earth","link":"/categories/environment/earth/"},{"name":"literature","slug":"environment/earth/literature","link":"/categories/environment/earth/literature/"},{"name":"literature","slug":"literature","link":"/categories/literature/"}]}